# -*- coding: utf-8 -*-
GREETING = u"Здравствуйте, %s! \u270b \nВас приветствует *iTMonopoly* учебный центр. " \
           u"Курсы по iT направлениям для детей и взрослых.\nВоспользуйтесь меню ниже:"
COURSES = u"\U0001F393 Курсы"
EVENTS = u"\U0001F3AB Мероприятия"
CONTACTS = u"\u260e Контакты"
ABOUT = u"\u2139 О компании"
SUBSCRIBE_TO_NEW_COURSES = u"\U0001F514 Подписаться на уведомления о курсах"
SUBSCRIBE_TO_NEW_EVENTS = u"\U0001F514 Подписаться на уведомления о мероприятиях"
UNSUBSCRIBE_TO_NEW_COURSES = u"\U0001F515 Отписаться от уведомлений о курсах"
UNSUBSCRIBE_TO_NEW_EVENTS = u"\U0001F515 Отписаться от уведомлений о мероприятиях"
YOU_CAN_SUBSCRIBE_TO_COURSES = u"\U0001F4A1 Вы можете подписаться на уведомления " \
                               u"о новых курсах, используя меню ниже"
YOU_CAN_SUBSCRIBE_TO_EVENTS = u"\U0001F4A1 Вы можете подписаться на уведомления " \
                              u"о новых мероприятиях, используя меню ниже"
YOU_CAN_UNSUBSCRIBE_TO_COURSES = u"\U0001F4A1 Вы можете отписаться от уведомлений " \
                                 u"о новых курсах, используя меню ниже"
YOU_CAN_UNSUBSCRIBE_TO_EVENTS = u"\U0001F4A1 Вы можете отписаться от уведомлений " \
                                u"о новых мероприятиях, используя меню ниже"
YOU_UNSUBSCRIBED_FROM_COURSES = u"Вы были отписаны от уведомлений о новых курсах \U0001F44C"
YOU_UNSUBSCRIBED_FROM_EVENTS = u"Вы были отписаны от уведомлений о новых мероприятиях \U0001F44C"
YOU_SUBSCRIBED_TO_COURSES = u"Вы были подписаны на уведомления о новых курсах \U0001F44C"
YOU_SUBSCRIBED_TO_EVENTS = u"Вы были подписаны на уведомлений о новых мероприятиях \U0001F44C"
FULL_COURSE_DESC = "*Название курса*\n" \
                   "_%s_\n" \
                   "%s\n\n" \
                   "*Возраст участников*\n" \
                   "%s\n\n" \
                   "*Старт курса*\n" \
                   "%s\n\n" \
                   "*Продолжительность курса*\n" \
                   "%s\n\n" \
                   "*Стоимость обучения*\n" \
                   "%s\n\n" \
                   "*Читать о курсе на сайте:* %s"
FULL_EVENT_DESC = "*Название мероприятия*\n" \
                  "_%s_\n" \
                  "%s\n\n" \
                  "*Дата проведения*\n" \
                  "%s\n\n" \
                  "*Начало мероприятия*\n" \
                  "%s\n\n" \
                  "*Возраст участников*\n" \
                  "%s\n\n" \
                  "*Условия*\n" \
                  "%s\n\n" \
                  "*Читать о мероприятии на сайте:* %s"
SEND_PICTURE = "Пришлите сюда фото для превью."
SEND_COURSE_INFO = "Пришлите описание курса используя *;* (точка с запятой): " \
                   "*название курса*;*описание курса*;*возраст участников*;*старт курса*;*продолжительность курса*;" \
                   "*стоимость обучения*;*ссылка на сайт*\n\n*Пример:* Программирование на JAVA;" \
                   "Открыт набор в новые группы!;15-55 лет;31 марта 2018 г.;5 месяцев;16 500 руб. в месяц;" \
                   "http://itmonopoly.com/courses/adults/java/"
SEND_EVENT_INFO = "Пришлите описание мероприятия используя *;* (точка с запятой): " \
                  "*название мероприятия*;*описание мероприятия*;*начало мероприятия*;" \
                  "*возраст участников*;*условия*;*ссылка на сайт*\n\n*Пример:* Создание компьютерных игр;" \
                  "Создание игрового уровня, с помощью преподавателя на мастер-классе;" \
                  "24/03/2018 11:00:00;8-15 лет;Участие бесплатное. Количество мест ограничено;" \
                  "http://itmonopoly.com/events/gamedev-event/"
HAVE_NOT_PERMISSIONS = "У вас нет прав для этой операции"
COURSES_FOR_KIDS = u"\U0001F9D2 Курсы для детей до 15 лет"
COURSES_FOR_ADULT = u"\U0001F9D1 Курсы для взрослых от 15 лет"
KINDS_OF_COURSES = "Какие курсы Вас интересуют?"
ABOUT_TEXT = "*iTMonopoly* — учебный центр, специализирующийся на " \
             "многопрофильном обучении в сфере информационных технологий.\n\n" \
             "Наши преподаватели дипломированные специалисты и действующие практики.\n\n" \
             "Программы обучения являются авторскими разработками и создаются с учетом возрастных " \
             "особенностей и последних требований индустрии. Программы регулярно обновляются, " \
             "что позволяет сохранять актуальность курсов по всем направлениям."
CONTACTS_TEXT = u'\U0001F4F1 *Телефон:* +7(495)154-95-62\n' \
                u'\U0001F4E7 *E-Mail:* info@itmonopoly.ru\n' \
                u'\U0001F310 *Сайт:* http://itmonopoly.com/\n' \
                u'\U0001F4CD *Адреса:*\n' \
                u'*Главная площадка:* Москва, м. Курская, 1 минута от метро, БЦ "Арма", ' \
                u'Нижний Сусальный переулок, д. 5, 1 этаж, стр. 8Б\n' \
                u'*Вторая площадка:* г. Москва, м. Менделеевская, Лесная улица, 63с1'
MAIN_STAGE_ADDRESS = 'г. Москва, Нижний Сусальный переулок, д. 5, стр. 8Б'
MAIN_STAGE_TITLE = 'Главная площадка'
SECOND_STAGE_ADDRESS = 'г. Москва, м. Менделеевская, Лесная улица, 63с1'
SECOND_STAGE_TITLE = 'Вторая площадка'
ERROR_DURING_PHOTO_ADD = "Возникла ошибка при добавлении фото. " \
                         "Убедитесь в том, что присылаете фотографию как «Фото», а не как «Файл»."
ERROR_DURING_INFO_ADD = "Проверьте правильность введенных данных и попробуйте еще раз."
CANCEL_OPERATION = u"\u274c Отменить операцию"
OPERATION_CANCELED = "Операция отменена."
READ_MORE = u"\U0001F4DC Подробнее"
REGISTER_FOR_COURSE = u"\u2705 Записаться на курс"
REGISTER_FOR_EVENT = u"\u2705 Зарегистрироваться"
COURSE_SUCCESSFULLY_ADDED = "Курс успешно добавлен! \n\nПревью:"
EVENT_SUCCESSFULLY_ADDED = "Мероприятие успешно добавлено! \n\nПревью:"
BACK_TO_MAIN_MENU = u"\U0001F51A Выйти в главное меню"
MAIN_MENU = "Вы вернулись в главное меню"
REGISTER_FREE = u"\U0001F193 Записаться на бесплатный урок"
BACK_TO_COURSES = u"\u21A9 Вернуться к курсам"
BACK_TO_EVENTS = u"\u21A9 Вернуться к мероприятиям"
ALL_COURSES_DISPLAYED = "Все курсы выведены"
ALL_EVENTS_DISPLAYED = "Все мероприятия выведены"
ADD_ANOTHER_COURSE = u"\u2795 Добавить еще один курс"
ADD_ANOTHER_EVENT = u"\u2795 Добавить еще одно мероприятие"
COURSE_EXISTS = u"\u2757 Данный курс уже существует, проверьте правильность введенных данных."
EVENT_EXISTS = u"\u2757 Данное мероприятие уже существует, проверьте правильность введенных данных."
SEND_COURSE_TITLE = "Пришлите название курса который Вы хотите удалить"
SEND_EVENT_TITLE = "Пришлите название мероприятия которое Вы хотите удалить"
COURSE_NOT_FOUND = u"\u2757 Курс который Вы пытаетесь удалить не найден. Попробуйте еще раз."
EVENT_NOT_FOUND = u"\u2757 Мероприятие которое Вы пытаетесь удалить не найдено. Попробуйте еще раз."
COURSE_DELETED = "Курс был успешно удален!"
EVENT_DELETED = "Мероприятие было успешно удалено!"
DELETE_ANOTHER_COURSE = u"\U0001F5D1 Удалить еще один курс"
DELETE_ANOTHER_EVENT = u"\U0001F5D1 Удалить еще одно мероприятие"
EVENTS_NOT_FOUND = "В данный момент никаких мероприятий не запланировано"
COURSES_NOT_FOUND = "В данный момент никаких курсов не запланировано"
EMAIL_BODY_REG = "Детали заявки:\n" \
                 "Курс: %s\n\n" \
                 "Данные пользователя:\n" \
                 "Имя: %s\n" \
                 "Телефон: %s\n" \
                 "e-mail: %s"
SUBJECT_REG = "Заявка на курс %s [%s]"
SUBJECT_REG_CANCEL = "ОТМЕНА Заявки на курс %s [%s]"
EMAIL_BODY_REGFREE = "Детали заявки:\n" \
                     "Урок: %s\n\n" \
                     "Данные пользователя:\n" \
                     "Имя: %s\n" \
                     "Телефон: %s\n" \
                     "e-mail: %s"
SUBJECT_REGFREE = "Заявка на бесплатный урок %s [%s]"
SUBJECT_REGFREE_CANCEL = "ОТМЕНА Заявки на бесплатный урок %s [%s]"
EMAIL_BODY_REGFREEEVENT = "Детали заявки:\n" \
                          "Мероприятие: %s\n\n" \
                          "Данные пользователя:\n" \
                          "Имя: %s\n" \
                          "Телефон: %s\n" \
                          "e-mail: %s"
SUBJECT_REGFREEEVENT = "Заявка на мероприятие %s [%s]"
SUBJECT_REGFREEEVENT_CANCEL = "ОТМЕНА Заявки на мероприятие %s [%s]"
SEND_EMAIL = u"\U0001F4E7 Введите ваш e-mail:"
SENDING_PHONE = u"\U0001F4F1 Отправить номер"
SEND_PHONE = u"\U0001F4F1 Для того, чтобы была возможность связаться с Вами, " \
             u"нам необходим Ваш номер телефона. Нажмите кнопку 'Отправить номер'"
INCORRECT_EMAIL = u"\u26A0 Введите корректный e-mail:"
REQUEST_FOR_EVENT_WAS_SEND = u"\U0001F64C Ваша заявка на мероприятие *«%s»* была отправлена. " \
                             u"С Вами свяжутся в ближайшее время!"
CANCEL_REQUEST_FOR_EVENT = u"\u274c Ваша заявка на мероприятие *«%s»* была отменена."
REQUEST_FOR_COURSE_WAS_SEND = u"\U0001F64C Ваша заявка на курс *«%s»* была отправлена. " \
                              u"С Вами свяжутся в ближайшее время!"
CANCEL_REQUEST_FOR_COURSE = u"\u274c Ваша заявка на курс *«%s»* была отменена."
REQUEST_FOR_COURSE_FREE_WAS_SEND = u"\U0001F64C Ваша заявка на бесплатный урок *«%s»* была отправлена. " \
                                   u"С Вами свяжутся в ближайшее время!"
CANCEL_REQUEST_FOR_COURSE_FREE = u"\u274c Ваша заявка на бесплатный урок *«%s»* была отменена."
REQUEST_ALREADY_SEND_FOR_EVENT = "Вами уже была отправлена заявка на данное мероприятие."
REQUEST_ALREADY_SEND_FOR_COURSE = "Вами уже была отправлена заявка на данный курс."
REQUEST_ALREADY_SEND_FOR_COURSE_FREE = "Вами уже была отправлена заявка на данный бесплатный урок."
CANCEL_REQUEST = u"\u274c Отменить заявку"
REGISTRATION_PROCESS_DONE = u"Процесс регистрации завершён! \U0001F44C\nТеперь Вы можете " \
                            u"подать заявку на интересующие Вас курсы, бесплатные уроки и мероприятия!"
SAVE = u"\u2714 Сохранить"
DELETE = u"\U0001F5D1 Удалить"
SEND_NOTIFICATION = u"\U0001F4E2 Отправить уведомление подписчикам"
SAVED = u"\u2705 Сохранено!"
DELETED = u"\U0001F6AE Удалено!"
NOTIFICATION_SEND = u"\u2705 Уведомления отправлены подписчикам"
NEW_EVENT = "НОВОЕ МЕРОПРИЯТИЕ"
NEW_COURSE = "НОВЫЙ КУРС"
STATISTICS = "Пользователи: *%s*\n" \
             "Заявки на курсы: *%s*\n" \
             "Заявки на бесплатные уроки: *%s*\n" \
             "Заявки на мероприятия: *%s*"
DETAIL_COURSES = "Детальная статистика по курсам:"
DETAIL_STATISTICS_COURSES = "*«%s»* \n" \
                            "*Заявки:* %s \n" \
                            "*Заявки на бесплатные уроки:* %s\n\n"
DETAIL_EVENTS = "Детальная статистика по мероприятиям:"
DETAIL_STATISTICS_EVENTS = "*«%s»* \n" \
                            "*Заявки:* %s \n\n"